//9.	Аквариум
//За рождения си ден Любомир получил аквариум с формата на паралелепипед.
//Първоначално прочитаме от конзолата на отделни редове размерите му –
//дължина, широчина и височина в сантиметри. Трябва да се пресметне
//колко литра вода ще събира аквариума, ако се знае, че
//определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа. 
//Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3 =1 000 куб см/. 

//Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.

//Вход
//От конзолата се четат 4 реда:
//1.	Дължина в см – цяло число в интервала [10 … 500] int
//2.	Широчина в см – цяло число в интервала [10 … 300] int
//3.	Височина в см – цяло число в интервала [10… 200]  int
//4.	Процент  – реално число в интервала [0.000 … 100.000] double

//Изход
//Да се отпечата на конзолата едно число:
//•	литрите вода, които ще  събира аквариума.

//Input
int lenghtCm = int.Parse(Console.ReadLine());
int widhCm = int.Parse(Console.ReadLine());
int heightCm = int.Parse(Console.ReadLine());
double percent = double.Parse(Console.ReadLine())/100;

//litres calulation
double volumeCm = lenghtCm * widhCm * heightCm;
double litresVolume = volumeCm/1000;
double neededLitres = litresVolume * (1-percent);

//output
Console.WriteLine(neededLitres);
