//02.Bonus Score
//Дадено е цяло число – начален брой точки.
//Върху него се начисляват бонус точки по правилата, описани по-долу.

//Да се напише програма, която пресмята бонус точките,
//които получава числото и общия брой точки (числото + бонуса).

//•	Ако числото е до 100 включително, бонус точките са 5.
//•	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
//•	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

//•	Допълнителни бонус точки (начисляват се отделно от предходните):
//o За четно число  + 1 т.
//o	За число, което завършва на 5  + 2 т.

//Input
int num = int.Parse(Console.ReadLine());

//Calculations
double bonus = 0;

if (num <= 100)
{
    bonus = 5;
}
else if (num > 100 && num <= 1000)
{
    bonus = num * 0.2;
}
else if (num > 1000)
{
    bonus = num * 0.1;
}

double addBonus = 0;

if (num % 2 == 0)
{
    addBonus= addBonus +1;
}
else if (num % 10 == 5)
{
    addBonus = addBonus +2;
}

//Output
Console.WriteLine(bonus + addBonus);
Console.WriteLine(num + bonus + addBonus);